public/blog/pinebook-pro/pinebook-pro-netbsd-installation/index.html
<!DOCTYPE html>
<html lang="en">
<head>  <meta charset="UTF-8">
  <title>Pinebook Pro Netbsd Installation</title>
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <link rel="stylesheet" href="/css/gtd.css">
  
  
</head>
<body>
  
<main>
  <div style="margin: 1rem;">
    <a href="/" style="
      display: inline-block;
      background-color: #eee;
      color: #333;
      padding: 0.4rem 0.8rem;
      border-radius: 6px;
      text-decoration: none;
      font-weight: bold;
      font-family: sans-serif;
      font-size: 0.9rem;
    ">
      ← Homepage
    </a>

  <h1>Pinebook Pro Netbsd Installation</h1>

  </div>
  <nav class="toc">
    <nav id="TableOfContents">
<ul>
<li><a href="#headline-1">Pinebook Pro Netbsd Installation</a>
<ul>
<li><a href="#headline-2">Preamble</a>
</li>
</ul>
</li>
<li><a href="#headline-3">Setting Up The System</a>
<ul>
<li><a href="#headline-4">Assumptions</a>
</li>
<li><a href="#headline-5">Configuring Network</a>
</li>
<li><a href="#headline-6">Configuring package manager</a>
</li>
<li><a href="#headline-7">Installing a desktop enviroment</a>
</li>
</ul>
</li>
</ul>
</nav>
  </nav> 

  <article>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Pinebook Pro Netbsd Installation
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<div id="outline-container-headline-2" class="outline-3">
<h3 id="headline-2">
Preamble
</h3>
<div id="outline-text-headline-2" class="outline-text-3">
<p>Guide for installing NetBSD on the Pinebook Pro including the installation of
packages, setting up networking, and other quality of life changes.</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
Setting Up The System
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
Assumptions
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<ul>
<li>You&#39;ve wrote the <a href="https://wiki.pine64.org/index.php/Pinebook_Pro_Software_Release#NetBSD_.5BmicroSD_.2FeMMC_Boot.5D">netbsd</a> image to your microsd/emmc</li>
<li>You&#39;ve booted into the system</li>
</ul>
<p>If you have problems booting from the microsd card, try disabling the emmc
chip. It used to be the case that you were only able to boot from microsd if the
chip was disabled. This info may become outdated.</p>
</div>
</div>
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
Configuring Network
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<p>Now its time to set up Wifi. There are at least two ways to do it:</p>
<ol>
<li>Manually configuring wpa_supplicant</li>
<li>Using wpa_cli (frontend to wpa_supplicant)</li>
</ol>
<p>This page will use the manual method. If you&#39;d like to use wpa_cli, here&#39;s a
<a href="https://wiki.archlinux.org/index.php/Wpa_supplicant#Connecting_with_wpa_cli">link</a> to the arch wiki page</p>
<p>
Identify your wirless network interface with <code>ifconfig</code>:</p>
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-shell" data-lang="shell"><span style="display:flex;"><span>ifconfig
</span></span><span style="display:flex;"><span>&gt; lo0 flags....
</span></span><span style="display:flex;"><span>&gt; run0: flags..... &lt;---- Substitute this interface <span style="color:#66d9ef">for</span> yours when referenced</span></span></code></pre></div>
</div>
<p>
Edit the system <code>rc.conf</code> file and configure <code>wpa_supplicant</code> &amp; <code>dhcpcd</code> to run at boot</p>
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-shell" data-lang="shell"><span style="display:flex;"><span>$ vi /etc/rc.conf
</span></span><span style="display:flex;"><span><span style="color:#75715e">#Append the following</span>
</span></span><span style="display:flex;"><span>dhcpcd<span style="color:#f92672">=</span>YES
</span></span><span style="display:flex;"><span>dhcpcd_flags<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;</span><span style="color:#e6db74">${</span>dhcpcd_flags<span style="color:#e6db74">}</span><span style="color:#e6db74"> -b&#34;</span>  <span style="color:#75715e">#This ensures boot wont hang when network isn&#39;t present</span>
</span></span><span style="display:flex;"><span>wpa_supplicant<span style="color:#f92672">=</span>YES
</span></span><span style="display:flex;"><span>wpa_supplicant_flags<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;-B -i run0 -c /etc/wpa_supplicant.conf&#34;</span></span></span></code></pre></div>
</div>
<p>
Create your <code>wpa_supplicant.conf</code>. This will contain your wireless SSID and
PASSWORD. Use the wpa_supplicant CLI if you require hashed passwords rather than
clear text passwords.</p>
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-shell" data-lang="shell"><span style="display:flex;"><span>$ vi /etc/wpa_supplicant.conf
</span></span><span style="display:flex;"><span>ctrl_interface<span style="color:#f92672">=</span>/var/run/wpa_supplicant
</span></span><span style="display:flex;"><span>ctrl_interface_group<span style="color:#f92672">=</span>wheel
</span></span><span style="display:flex;"><span>update_config<span style="color:#f92672">=</span><span style="color:#ae81ff">1</span>
</span></span><span style="display:flex;"><span>network<span style="color:#f92672">={</span>
</span></span><span style="display:flex;"><span>        ssid<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;my favourite network&#34;</span>
</span></span><span style="display:flex;"><span>        psk<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;hunter2&#34;</span>
</span></span><span style="display:flex;"><span><span style="color:#f92672">}</span>
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span><span style="color:#75715e"># Starting wpa_supplicant</span>
</span></span><span style="display:flex;"><span>/etc/rc.d/wpa_supplicant start</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
Configuring package manager
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<p>Netbsd has a commented URL for downloading binary packages in
<code>~/.profile</code>. Uncomment it then source the file</p>
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-shell" data-lang="shell"><span style="display:flex;"><span>$ vi ~/.profile
</span></span><span style="display:flex;"><span>export PKG_PATH<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;https://...&#34;</span>
</span></span><span style="display:flex;"><span>. ~/.profile
</span></span><span style="display:flex;"><span><span style="color:#75715e"># Alternatively reboot here</span></span></span></code></pre></div>
</div>
<p>
Update the repository</p>
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-shell" data-lang="shell"><span style="display:flex;"><span>pkg_add -v pkgin
</span></span><span style="display:flex;"><span>pkgin update
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span><span style="color:#e6db74">&#34;Warning earm doesn&#39;t match your current architecture....&#34;</span>
</span></span><span style="display:flex;"><span>Still want to proceed? <span style="color:#f92672">[</span>y/N<span style="color:#f92672">]</span></span></span></code></pre></div>
</div>
<p>
Stop here. We have to make sure our architecture is set correctly, or else packages won&#39;t install properly.
Fortunatley this is pretty simple.</p>
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-shell" data-lang="shell"><span style="display:flex;"><span><span style="color:#75715e"># Note how I overwrote the file.</span>
</span></span><span style="display:flex;"><span><span style="color:#75715e"># If you choose to instead append the text, make sure you edit repositories.conf to delete the original url</span>
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>$ echo $PKG_PATH &gt; /usr/pkg/etc/pkgin/repositories.conf</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-7" class="outline-3">
<h3 id="headline-7">
Installing a desktop enviroment
</h3>
<div id="outline-text-headline-7" class="outline-text-3">
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-shell" data-lang="shell"><span style="display:flex;"><span>pkgin install xfce4 xinit
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span><span style="color:#75715e"># Linking our X system so xinit can read from it. This avoids errors.</span>
</span></span><span style="display:flex;"><span>ln -s /usr/X11R7/bin/X /usr/pkg/bin/X
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span><span style="color:#75715e"># Adding xfce4-session to our .xinitrc</span>
</span></span><span style="display:flex;"><span>echo <span style="color:#e6db74">&#34;exec xfce4-session&#34;</span> &gt; ~/.xinitrc
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span><span style="color:#75715e"># Booting the DE using the xinitrc file</span>
</span></span><span style="display:flex;"><span>startx</span></span></code></pre></div>
</div>
<ul>
<li>Give XFCE4 a moment to load in.</li>
<li>Alt+f1 will bring you back to the tty prompt.</li>
<li>Alt+f2 will bring you to the gui</li>
</ul>
</div>
</div>
</div>
</div>

  </article>
</main>

</body>
</html>
